Revit 2026 API

# BeamSystemBeamType Property

---

Retrieves or changes the Beam Type of the BeamSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbol BeamType { get; set; }
```
```vb
Public Property BeamType As FamilySymbol
	Get
	Set
```
```cpp
public:
property FamilySymbol^ BeamType {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
```
```fsharp
member BeamType : FamilySymbol with get, set
```

#### Property Value

FamilySymbol

#### Reference

BeamSystem Class

Autodesk.Revit.DB Namespace